# Section 07: SQL and Relational Databases

### What is a Database?
- In general, databases store sets of data that can be queried for use in other applications. A database management system supports the development, administration and use of database platforms.


### What is a Relational Database? 
- A *relational database management system* (**RDBMS**) is a type of DBMS with a row-based table structure that connects related data elements and includes functions that maintain the security, accuracy, integrity and consistency of the data.
- The most basic **RDBMS** functions are related to *create, read, update and delete* operations, collectively known as **CRUD**.

### What is SQL?

- **SQL** (usually pronounced like the word “sequel”) stands for Structured Query Language.
- A programming language used to communicate with data stored in a **RDBMS** (relational database management system).
- SQL syntax is similar to the English language, which makes it relatively easy to write, read, and interpret.

### Schema
A relational database schema helps you to organize and understand the structure of a database by showing how all of the tables are related to each other.

![alt text](images/employees-schema.png)

### Relationships

The logical association among entities is called relationship. Relationships are mapped between entities in various ways. 

**Relationship Mappings** −

- one to one
- one to many
- many to many

### One to One Relationship

<img src="images/one-to-one.png" >

### One to Many Relationship

This is the most commonly used type of relationship. Consider an e-commerce website, with the following:

Customers can make many orders.
Orders can contain many items.
Items can have descriptions in many languages.

<img src="images/one-to-many.png" >

### Many to Many Relationship

In some cases, you may need multiple instances on both sides of the relationship. For example, each order can contain multiple items. And each item can also be in multiple orders.

<img src="images/many-to-many.png" >

***For these relationships, we need to create an extra table to track the relationships:***

<img src="images/many-to-many-junction.png" >

### SQL Data Types


SQL data types can be broadly divided into following categories.

- Numeric data types such as int, tinyint, bigint, float, real etc.
- Date and Time data types such as Date, Time, Datetime etc.
- Character and String data types such as char, varchar, text etc.
- Unicode character string data types, for example nchar, nvarchar, ntext etc.
- Binary data types such as binary, varbinary etc.
- Miscellaneous data types – clob, blob, xml, cursor, table etc.

<img src="images/data-type-mapping.png" >

#### SQLite Data Types

Any column declared in an SQLite database is assigned a type affinity depending on its declared data type. Here the list of type affinities in SQLite:

- TEXT
- NUMERIC
- INTEGER
- REAL
- BLOB

## Using SQL in Python


We're going to play around with this Pokemon database!

<img src="images/pokemon_db.png" style="width:600px;">

In [2]:
import pandas as pd
import sqlite3

#### The Cursor

In [3]:
cnx = sqlite3.connect('pokemon.db') # connect to the db file

#### Pandas!

**Important note on syntax**: use `double quotes ""` when quoting strings within your query and wrap the entire query in `single quotes ''`.

In [4]:
query = 'SELECT * FROM pokemon'
pd.read_sql(query, cnx)

      id        name  base_experience  weight  height
0      1   bulbasaur               64      69       7
1      2     ivysaur              142     130      10
2      3    venusaur              236    1000      20
3      4  charmander               62      85       6
4      5  charmeleon              142     190      11
..   ...         ...              ...     ...     ...
146  147     dratini               60      33      18
147  148   dragonair              147     165      40
148  149   dragonite              270    2100      22
149  150      mewtwo              306    1220      20
150  151         mew              270      40       4

[151 rows x 5 columns]

### Parts of a SQL Query:
* `SELECT ... FROM ...`: Which columns from which table
* `WHERE`: Conditions to filter your query by
* `JOIN`: Put tables together
* `GROUP BY`: Group and aggregate data
* `HAVING`: Filtering after a `GROUP BY`
* `ORDER BY`: How to sort the table
* `LIMIT`: How many rows to query

In [5]:
# q1: Select everything!

q1 = 'SELECT * FROM pokemon'
pd.read_sql(q1, cnx)

      id        name  base_experience  weight  height
0      1   bulbasaur               64      69       7
1      2     ivysaur              142     130      10
2      3    venusaur              236    1000      20
3      4  charmander               62      85       6
4      5  charmeleon              142     190      11
..   ...         ...              ...     ...     ...
146  147     dratini               60      33      18
147  148   dragonair              147     165      40
148  149   dragonite              270    2100      22
149  150      mewtwo              306    1220      20
150  151         mew              270      40       4

[151 rows x 5 columns]

In [10]:
# q1: Select everything!

q4 = 'SELECT * FROM types'
pd.read_sql(q4, cnx)

    id      name
0    1    normal
1    2  fighting
2    3    flying
3    4    poison
4    5    ground
5    6      rock
6    7       bug
7    8     ghost
8    9     steel
9   10      fire
10  11     water
11  12     grass
12  13  electric
13  14   psychic
14  15       ice
15  16    dragon
16  17      dark
17  18     fairy

In [7]:
test = 'SELECT * FROM pokemon_types'
pd.read_sql(test, cnx)

      id  pokemon_id  type_id
0      1           1       12
1      2           1        4
2      3           2       12
3      4           2        4
4      5           3       12
..   ...         ...      ...
213  214         148       16
214  215         149       16
215  216         149        3
216  217         150       14
217  218         151       14

[218 rows x 3 columns]

In [8]:
# q2: Find all the rows from the "pokemon_types" table where the type_id is 3.

q2 = 'SELECT * FROM pokemon_types WHERE type_id = 3'
pd.read_sql(q2, cnx)

     id  pokemon_id  type_id
0    10           6        3
1    17          12        3
2    25          16        3
3    27          17        3
4    29          18        3
5    33          21        3
6    35          22        3
7    59          41        3
8    61          42        3
9   123          83        3
10  125          84        3
11  127          85        3
12  178         123        3
13  187         130        3
14  205         142        3
15  208         144        3
16  210         145        3
17  212         146        3
18  216         149        3

In [9]:
q1 = 'SELECT id, name FROM pokemon'
pd.read_sql(q1, cnx)

      id        name
0      1   bulbasaur
1      2     ivysaur
2      3    venusaur
3      4  charmander
4      5  charmeleon
..   ...         ...
146  147     dratini
147  148   dragonair
148  149   dragonite
149  150      mewtwo
150  151         mew

[151 rows x 2 columns]

In [9]:
# q3: Find all the rows from the "pokemon_types" table where the associated type is "water".

q3 = 'SELECT pokemon_types.* FROM pokemon_types JOIN types ON types.id = pokemon_types.type_id \
    WHERE types.name = "water"'
pd.read_sql(q3, cnx)

     id  pokemon_id  type_id
0    11           7       11
1    12           8       11
2    13           9       11
3    80          54       11
4    81          55       11
5    86          60       11
6    87          61       11
7    88          62       11
8   102          72       11
9   104          73       11
10  114          79       11
11  116          80       11
12  128          86       11
13  129          87       11
14  133          90       11
15  134          91       11
16  146          98       11
17  147          99       11
18  168         116       11
19  169         117       11
20  170         118       11
21  171         119       11
22  172         120       11
23  173         121       11
24  185         129       11
25  186         130       11
26  188         131       11
27  192         134       11
28  197         138       11
29  199         139       11
30  201         140       11
31  203         141       11

In [13]:
# q4: Find the average weight for each type. 
# Order the results from highest weight to lowest weight. Display the type name next to the average weight.

q4 = 'SELECT AVG(weight), types.name FROM pokemon \
    INNER JOIN pokemon_types ON pokemon_types.pokemon_id = pokemon.id  \
    INNER JOIN types ON types.id = pokemon_types.type_id \
    GROUP by types.name \
    ORDER BY AVG(weight) DESC'
pd.read_sql(q4, cnx)

    AVG(weight)      name
0   1137.000000       ice
1    930.454545      rock
2    799.357143    ground
3    766.000000    dragon
4    612.473684    flying
5    550.071429   psychic
6    542.500000  fighting
7    536.750000     water
8    500.863636    normal
9    480.250000      fire
10   330.000000     steel
11   317.888889  electric
12   264.857143     grass
13   239.000000     fairy
14   238.545455    poison
15   229.916667       bug
16   135.666667     ghost

In [17]:
# q5: Find the names and ids the pokemon that have more than 1 type.

q5 = 'SELECT pokemon.id, pokemon.name FROM pokemon \
    INNER JOIN pokemon_types ON pokemon.id = pokemon_types.pokemon_id \
    GROUP BY pokemon_id HAVING COUNT(pokemon_id) > 1'
pd.read_sql(q5, cnx)

     id        name
0     1   bulbasaur
1     2     ivysaur
2     3    venusaur
3     6   charizard
4    12  butterfree
..  ...         ...
62  142  aerodactyl
63  144    articuno
64  145      zapdos
65  146     moltres
66  149   dragonite

[67 rows x 2 columns]

In [15]:
# q6: Find the id of the type that has the most pokemon. Display type_id next to the number of pokemon having that type. 

q6 = 'SELECT COUNT(pokemon_id) AS num_pokemon, type_id FROM pokemon_types \
    GROUP BY type_id ORDER BY num_pokemon DESC LIMIT 1'
pd.read_sql(q6, cnx)

   num_pokemon  type_id
0           33        4